#Project Code
##Group 9
###Nicolas Maitin

In [ ]:
%%capture

!pip install ipython-sql
!pip install databases
!pip install databases[sqlite]

In [ ]:
import sqlalchemy
%load_ext sql
%sql sqlite:///projectdb.db

'Connected: @projectdb.db'

In [ ]:
%%sql

  DROP TABLE IF EXISTS [User];
  CREATE TABLE [User] (
    [ID] INTEGER PRIMARY KEY,
    [firstName] nvarchar(250) NOT NULL,
    [lastName] nvarchar(250) NOT NULL,
    [email] nvarchar(250) NOT NULL,
    [password] nvarchar(250) NOT NULL,
    [birthdate] DATE NOT NULL
  );
  
  DROP TABLE IF EXISTS [Genre];
  CREATE TABLE [Genre] (
    [ID] INTEGER PRIMARY KEY,
    [genre] nvarchar(250) NOT NULL
  );

  DROP TABLE IF EXISTS [Tv_Series];
  CREATE TABLE [TV_Series] (
    [ID] INTEGER PRIMARY KEY,
    [title] nvarchar(250) NOT NULL,
    [numOfSeasons] int NOT NULL,
    [genreID] int NOT NULL,
    FOREIGN KEY ([genreID]) REFERENCES [Genre]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [Tv_Season];
  CREATE TABLE [Tv_Season] (
    [ID] INTEGER PRIMARY KEY,
    [tvID] int NOT NULL,
    [seasonNum] int NOT NULL,
    [numOfEpisodes] int NOT NULL,
    FOREIGN KEY ([tvID]) REFERENCES [Tv_Series]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [Tv_Episode];
  CREATE TABLE [Tv_Episode] (
    [ID] INTEGER PRIMARY KEY,
    [tvID] int NOT NULL,
    [seasonID] int NOT NULL,
    [episodeNum] int NOT NULL,
    [title] nvarchar(250) NOT NULL,
    [runtime] float NOT NULL,
    [airDate] DATE NOT NULL,
    FOREIGN KEY ([tvID]) REFERENCES [Tv_Series]([ID]) ON DELETE SET NULL,
    FOREIGN KEY ([seasonID]) REFERENCES [Tv_Season]([ID]) ON DELETE SET NULL
  );  

  DROP TABLE IF EXISTS [Movie];
  CREATE TABLE [Movie] (
    [ID] INTEGER PRIMARY KEY,
    [title] nvarchar(250) NOT NULL,
    [runtime] float NOT NULL,
    [releaseDate] DATE NOT NULL,
    [genreID] INT NOT NULL,
    FOREIGN KEY ([genreID]) REFERENCES [GENRE]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [Profile];
  CREATE TABLE [Profile] (
    [ID] INTEGER PRIMARY KEY,
    [userID] int NOT NULL,
    [name] nvarchar(250) NOT NULL,
    FOREIGN KEY ([userID]) REFERENCES [User]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [Payment_Info];
  CREATE TABLE [Payment_Info] (
    [ID] INTEGER PRIMARY KEY,
    [userID] int NOT NULL,
    [nameOnCard] nvarchar(250) NOT NULL,
    [cardNum] nvarchar(250) NOT NULL,
    [expiration] DATE NOT NULL,
    [csv] nvarchar(3) NOT NULL,
    FOREIGN KEY ([userID]) REFERENCES [User]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [My_Stuff];
  CREATE TABLE [My_Stuff] (
    [myStuffID] INTEGER PRIMARY KEY,
    [profileID] int NOT NULL,
    [tvShowID] int,
    [episodeID] int,
    [movieID] int,
    FOREIGN KEY ([profileID]) REFERENCES [Profile]([ID]) ON DELETE SET NULL,
    FOREIGN KEY ([tvShowID]) REFERENCES [Tv_Series]([ID]) ON DELETE SET NULL,
    FOREIGN KEY ([episodeID]) REFERENCES [Tv_Episode]([ID]) ON DELETE SET NULL,
    FOREIGN KEY ([movieID]) REFERENCES [Movie]([ID]) ON DELETE SET NULL
  );

 * sqlite:///projectdb.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql

PRAGMA foreign_keys = ON;

 * sqlite:///projectdb.db
Done.

[]

In [ ]:
%%sql

PRAGMA foreign_keys;

 * sqlite:///projectdb.db
Done.

[(1,)]

In [ ]:
%%sql

INSERT INTO User([firstName], [lastName], [email], [password], [birthdate]) VALUES ('Nicolas', 'Maitin', 'nicolasmaitinNM@gmail.com', 'h3lp3r2', '1995-07-25');
INSERT INTO User([firstName], [lastName], [email], [password], [birthdate]) VALUES ('James', 'Adams', 'jamesa@gmail.com', 'cr00k3d', '1972-10-14');
INSERT INTO User([firstName], [lastName], [email], [password], [birthdate]) VALUES ('Boubou', 'Magassa', 'bmagassa@gmail.com', 'm3rst1l', '2000-02-08');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Genre([genre]) VALUES ('Drama');
INSERT INTO Genre([genre]) VALUES ('Action');
INSERT INTO Genre([genre]) VALUES ('Comedy');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Tv_Series([title], [numOfSeasons], [genreID]) VALUES ('30 Rock', 7, 3);
INSERT INTO Tv_Series([title], [numOfSeasons], [genreID]) VALUES ('24', 8, 2);
INSERT INTO Tv_Series([title], [numOfSeasons], [genreID]) VALUES ('Snowfall', 5, 1);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Tv_Season([tvID], [seasonNum], [numOfEpisodes]) VALUES (1, 4, 22);
INSERT INTO Tv_Season([tvID], [seasonNum], [numOfEpisodes]) VALUES (2, 5, 24);
INSERT INTO Tv_Season([tvID], [seasonNum], [numOfEpisodes]) VALUES (3, 2, 10);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Tv_Episode([tvID], [seasonID], [episodeNum], [title], [runtime], [airDate]) VALUES (1, 1, 5, 'Jack the Writer', 22.56, '2012-03-15');
INSERT INTO Tv_Episode([tvID], [seasonID], [episodeNum], [title], [runtime], [airDate]) VALUES (2, 2, 9, '9:00am-10:00am', 49.20, '2006-3-25');
INSERT INTO Tv_Episode([tvID], [seasonID], [episodeNum], [title], [runtime], [airDate]) VALUES (3, 3, 10, 'Celebration', 56.32, '2020-10-03');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Movie([title], [runtime], [releaseDate], [genreID]) VALUES ('The One', 87, '2001-11-02', 2);
INSERT INTO Movie([title], [runtime], [releaseDate], [genreID]) VALUES ('Parasite', 132, '2019-05-21', 1);
INSERT INTO Movie([title], [runtime], [releaseDate], [genreID]) VALUES ('The 40 Year Old Virgin', 116, '2005-8-19', 3);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Profile([userId], [name]) VALUES (1, 'Nic');
INSERT INTO Profile([userId], [name]) VALUES (2, 'James');
INSERT INTO Profile([userId], [name]) VALUES (3, 'Bou');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO My_Stuff([profileID], [tvshowID]) VALUES (1, 1);
INSERT INTO My_Stuff([profileID], [episodeID]) VALUES (2, 3);
INSERT INTO My_Stuff([profileID], [movieID]) VALUES (3, 2);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO Payment_Info([userID], [nameOnCard], [cardNum], [expiration], [csv]) VALUES (1, 'Nicolas Maitin', '763174697368790', '2025-03-01', 230);
INSERT INTO Payment_Info([userID], [nameOnCard], [cardNum], [expiration], [csv]) VALUES (2, 'James Deen', '94761598769376', '2022-06-01', 635);
INSERT INTO Payment_Info([userID], [nameOnCard], [cardNum], [expiration], [csv]) VALUES (3, 'Martin Scorsese', '97834615976976', '2027-11-01', 324);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM User u
LEFT JOIN Payment_Info pi ON u.ID = pi.userID;

 * sqlite:///projectdb.db
Done.

[(1, 'Nicolas', 'Maitin', 'nicolasmaitinNM@gmail.com', 'h3lp3r2', '1995-07-25', 1, 1, 'Nicolas Maitin', '763174697368790', '2025-03-00', '230'),
 (2, 'James', 'Adams', 'jamesa@gmail.com', 'cr00k3d', '1972-10-14', 2, 2, 'James Deen', '94761598769376', '2022-06-00', '635'),
 (3, 'Boubou', 'Magassa', 'bmagassa@gmail.com', 'm3rst1l', '2000-02-08', 3, 3, 'Martin Scorsese', '97834615976976', '2027-11-00', '324')]

In [ ]:
%%sql

SELECT *
FROM User u
LEFT JOIN Profile p ON u.ID = p.userID
LEFT JOIN My_Stuff ms ON p.ID = ms.profileID
LEFT JOIN Tv_Series ts ON ms.tvShowID = ts.ID
LEFT JOIN Tv_Episode ep ON ms.episodeID = ep.ID
LEFT JOIN Movie mv ON ms.movieID = mv.ID

 * sqlite:///projectdb.db
Done.

[(1, 'Nicolas', 'Maitin', 'nicolasmaitinNM@gmail.com', 'h3lp3r2', '1995-07-25', 1, 1, 'Nic', 1, 1, 1, None, None, 1, '30 Rock', 7, 3, None, None, None, None, None, None, None, None, None, None, None, None),
 (2, 'James', 'Adams', 'jamesa@gmail.com', 'cr00k3d', '1972-10-14', 2, 2, 'James', 2, 2, None, 3, None, None, None, None, None, 3, 3, 3, 10, 'Celebration', 56.32, '2020-10-03', None, None, None, None, None),
 (3, 'Boubou', 'Magassa', 'bmagassa@gmail.com', 'm3rst1l', '2000-02-08', 3, 3, 'Bou', 3, 3, None, None, 2, None, None, None, None, None, None, None, None, None, None, None, 2, 'Parasite', 132.0, '2019-05-21', 1)]

In [ ]:
%%sql

SELECT *
FROM Tv_Series ser
LEFT JOIN Tv_Season sea ON ser.ID = sea.tvID
LEFT JOIN Tv_Episode ep ON sea.ID = ep.seasonID

 * sqlite:///projectdb.db
Done.

[(1, '30 Rock', 7, 3, 1, 1, 4, 22, 1, 1, 1, 5, 'Jack the Writer', 22.56, '2012-03-15'),
 (2, '24', 8, 2, 2, 2, 5, 24, 2, 2, 2, 9, '9:00am-10:00am', 49.2, '2006-3-25'),
 (3, 'Snowfall', 5, 1, 3, 3, 2, 10, 3, 3, 3, 10, 'Celebration', 56.32, '2020-10-03')]

In [ ]:
%%sql

SELECT *
FROM Genre g
LEFT JOIN Tv_Series ts ON g.ID = ts.genreID
LEFT JOIN Movie mv ON g.ID = mv.genreID

 * sqlite:///projectdb.db
Done.

[(1, 'Drama', 3, 'Snowfall', 5, 1, 2, 'Parasite', 132.0, '2019-05-21', 1),
 (2, 'Action', 2, '24', 8, 2, 1, 'The One', 87.0, '2001-11-02', 2),
 (3, 'Comedy', 1, '30 Rock', 7, 3, 3, 'The 40 Year Old Virgin', 116.0, '2005-8-19', 3)]

In [ ]:
%%sql

SELECT *
FROM Genre g
LEFT JOIN Tv_Series ts ON g.ID = ts.genreID
LEFT JOIN Movie mv ON g.ID = mv.genreID
WHERE g.genre IS 'Drama'

 * sqlite:///projectdb.db
Done.

[(1, 'Drama', 3, 'Snowfall', 5, 1, 2, 'Parasite', 132.0, '2019-05-21', 1)]

In [ ]:
%%sql

SELECT *
FROM User u
LEFT JOIN Profile p ON u.ID = p.userID

 * sqlite:///projectdb.db
Done.

[(1, 'Nicolas', 'Maitin', 'nicolasmaitinNM@gmail.com', 'h3lp3r2', '1995-07-25', 1, 1, 'Nic'),
 (2, 'James', 'Adams', 'jamesa@gmail.com', 'cr00k3d', '1972-10-14', 2, 2, 'James'),
 (3, 'Boubou', 'Magassa', 'bmagassa@gmail.com', 'm3rst1l', '2000-02-08', 3, 3, 'Bou')]

In [ ]:
%%sql

UPDATE Tv_Season
SET numOfEpisodes = 11
WHERE id = 3;

 * sqlite:///projectdb.db
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM Tv_Season;

 * sqlite:///projectdb.db
Done.

[(1, 1, 4, 22), (2, 2, 5, 24), (3, 3, 2, 11)]